openxc/vi-firmware/src/libs/CDL/LPC11UxxLib/src/lpc11uxx_i2c.c
	returnCode = (i2c->STAT & I2C_STAT_CODE_BITMASK);
	// Save current status
	txrx_setup->status = returnCode;
	// there's no relevant information
	if (returnCode == I2C_I2STAT_NO_INF){
		i2c->CONCLR = I2C_I2CONCLR_SIC;
		return;
	}


	switch (returnCode)
	{

	/* No status information */
	case I2C_I2STAT_NO_INF:
		i2c->CONSET = I2C_I2CONSET_AA;
		i2c->CONCLR = I2C_I2CONCLR_SIC;
		break;

	/* Reading phase -------------------------------------------------------- */
	/* Own SLA+R has been received, ACK has been returned */
	case I2C_I2STAT_S_RX_SLAW_ACK:
	/* General call address has been received, ACK has been returned */
	case I2C_I2STAT_S_RX_GENCALL_ACK:
		i2c->CONSET = I2C_I2CONSET_AA;
		i2c->CONCLR = I2C_I2CONCLR_SIC;
		break;

	/* Previously addressed with own SLA;
	 * DATA byte has been received;
	 * ACK has been returned */
	case I2C_I2STAT_S_RX_PRE_SLA_DAT_ACK:
	/* DATA has been received, ACK hasn been return */
	case I2C_I2STAT_S_RX_PRE_GENCALL_DAT_ACK:
		/*
		 * All data bytes that over-flow the specified receive
		 * data length, just ignore them.
		 */
		if ((txrx_setup->rx_count < txrx_setup->rx_length) \
				&& (txrx_setup->rx_data != NULL)){
			*(uint8_t *)(txrx_setup->rx_data + txrx_setup->rx_count) = (uint8_t)i2c->DAT;
			txrx_setup->rx_count++;
		}
		i2c->CONSET = I2C_I2CONSET_AA;
		i2c->CONCLR = I2C_I2CONCLR_SIC;
		break;

	/* Previously addressed with own SLA;
	 * DATA byte has been received;
	 * NOT ACK has been returned */
	case I2C_I2STAT_S_RX_PRE_SLA_DAT_NACK:
	/* DATA has been received, NOT ACK has been returned */
	case I2C_I2STAT_S_RX_PRE_GENCALL_DAT_NACK:
		i2c->CONCLR = I2C_I2CONCLR_SIC;
		break;

	/*
	 * Note that: Return code only let us know a stop condition mixed
	 * with a repeat start condition in the same code value.
	 * So we should provide a time-out. In case this is really a stop
	 * condition, this will return back after time out condition. Otherwise,
	 * next session that is slave receive data will be completed.
	 */

	/* A Stop or a repeat start condition */
	case I2C_I2STAT_S_RX_STA_STO_SLVREC_SLVTRX:
		// Temporally lock the interrupt for timeout condition
		I2C_IntCmd(i2c, 0);
		i2c->CONCLR = I2C_I2CONCLR_SIC;
		// enable time out
		timeout = I2C_SLAVE_TIME_OUT;
		while(1){
			if (i2c->CONSET & I2C_I2CONSET_SI){
				// re-Enable interrupt
				I2C_IntCmd(i2c, 1);
				break;
			} else {
				timeout--;
				if (timeout == 0){
					// timeout occur, it's really a stop condition
					txrx_setup->status |= I2C_SETUP_STATUS_DONE;
					goto s_int_end;
				}
			}
		}
		break;

	/* Writing phase -------------------------------------------------------- */
	/* Own SLA+R has been received, ACK has been returned */
	case I2C_I2STAT_S_TX_SLAR_ACK:
	/* Data has been transmitted, ACK has been received */
	case I2C_I2STAT_S_TX_DAT_ACK:
		/*
		 * All data bytes that over-flow the specified receive
		 * data length, just ignore them.
		 */
		if ((txrx_setup->tx_count < txrx_setup->tx_length) \
				&& (txrx_setup->tx_data != NULL)){
			i2c->DAT = *(uint8_t *) (txrx_setup->tx_data + txrx_setup->tx_count);
			txrx_setup->tx_count++;
		}
		i2c->CONSET = I2C_I2CONSET_AA;
		i2c->CONCLR = I2C_I2CONCLR_SIC;
		break;

	/* Data has been transmitted, NACK has been received,
	 * that means there's no more data to send, exit now */
	/*
	 * Note: Don't wait for stop event since in slave transmit mode,
	 * since there no proof lets us know when a stop signal has been received
	 * on slave side.
	 */
	case I2C_I2STAT_S_TX_DAT_NACK:
		i2c->CONSET = I2C_I2CONSET_AA;
		i2c->CONCLR = I2C_I2CONCLR_SIC;
		txrx_setup->status |= I2C_SETUP_STATUS_DONE;
		goto s_int_end;

	// Other status must be captured
	default:
s_int_end:
		// Disable interrupt
		I2C_IntCmd(i2c, 0);
		i2c->CONCLR = I2C_I2CONCLR_AAC | I2C_I2CONCLR_SIC | I2C_I2CONCLR_STAC;
		// Call callback if installed
		if (txrx_setup->callback != NULL){
			txrx_setup->callback();
		}
		break;
	}
}

/**
 * @}
 */


/* Public functions ------------------------------------------------------------------- */
/** @defgroup I2C_Public_Functions
 * @{
 */

/*********************************************************************//**
 * @brief 		Setup clock rate for I2C peripheral
 * @param[in] 	i2c	I2C peripheral
 * @param[in]	target_clock : clock of I2C (Hz)
 * @return 		None
 ***********************************************************************/
void I2C_SetClock (LPC_I2C_Type *i2c, uint32_t target_clock)
{
	uint32_t temp;

	SystemCoreClockUpdate();
	temp = SystemCoreClock  / target_clock;

	/* Set the I2C clock value to register */
	i2c->SCLH = (uint32_t)(temp / 2);
	i2c->SCLL = (uint32_t)(temp - i2c->SCLH);

	/*  I2C I/O config */
	if(target_clock<=400000)						/* Standard or Fast mode */
		temp = 0;
	else											/* Fast mode plus */
		temp = 2;
    LPC_IOCON->PIO0_4 &= ~0x3FF;
    LPC_IOCON->PIO0_4 = (0x01 | (temp<<8));			/* I2C SCL */
    LPC_IOCON->PIO0_5 &= ~0x3FF;
    LPC_IOCON->PIO0_5 = (0x01 | (temp<<8));			/* I2C SDA */

}


/*********************************************************************//**
 * @brief		De-initializes the I2C peripheral registers to their
*                  default reset values.
 * @param[in]	i2c	I2C peripheral
 * @return 		None
 **********************************************************************/
void I2C_DeInit(LPC_I2C_Type* i2c)
{

	/* Disable I2C control */
	i2c->CONCLR = I2C_I2CONCLR_I2ENC;
	/* Disable power for I2C0 module */
      LPC_SYSCON->SYSAHBCLKCTRL  =  LPC_SYSCON->SYSAHBCLKCTRL & (~(1<<5));
}


/********************************************************************//**
 * @brief		Initializes the i2c peripheral with specified parameter.
 * @param[in]	i2c	I2C peripheral
 * @param[in]	clockrate Target clock rate value to initialized I2C
 * 				peripheral
 * @return 		None
 *********************************************************************/
void I2C_Init(LPC_I2C_Type *i2c, uint32_t clockrate)
{
    LPC_SYSCON->PRESETCTRL |= (0x1<<1);
    LPC_SYSCON->SYSAHBCLKCTRL |= (1<<5);
    /* Set clock rate */
    I2C_SetClock(i2c, clockrate);
    /* Set I2C operation to default */
    i2c->CONCLR = (I2C_I2CONCLR_AAC | I2C_I2CONCLR_STAC | I2C_I2CONCLR_I2ENC);
}
/*********************************************************************//**
 * @brief		Enable or disable I2C peripheral's operation
 * @param[in]	i2c I2C peripheral
 * @param[in]	NewState New State of i2c peripheral's operation
 * @return 		none
 **********************************************************************/
void I2C_Cmd(LPC_I2C_Type* i2c, FunctionalState NewState)
{

	if (NewState == ENABLE)
	{
		i2c->CONSET = I2C_I2CONSET_I2EN;
	}
	else
	{
		i2c->CONCLR = I2C_I2CONCLR_I2ENC;
	}
}


/*********************************************************************//**
 * @brief 		Transmit and Receive data in master mode
 * @param[in] 	i2c				Pointr to a LPC_I2C_Type structure
 * @param[in]	TransferCfg		Pointer to a I2C_M_SETUP_Type structure that
 * 								contains specified information about the
 * 								configuration for master transfer.
 * @param[in]	Opt				a I2C_TRANSFER_OPT_Type type that selected for
 * 								interrupt or polling mode.
 * @return 		SUCCESS or ERROR
 *
 * Note:
 * - In case of using I2C to transmit data only, either transmit length set to 0
 * or transmit data pointer set to NULL.
 * - In case of using I2C to receive data only, either receive length set to 0
 * or receive data pointer set to NULL.
 * - In case of using I2C to transmit followed by receive data, transmit length,
 * transmit data pointer, receive length and receive data pointer should be set
 * corresponding.
 **********************************************************************/
Status I2C_MasterTransferData(LPC_I2C_Type *i2c, I2C_M_SETUP_Type *TransferCfg, \
								I2C_TRANSFER_OPT_Type Opt)
{
	uint8_t *txdat;
	uint8_t *rxdat;
	uint32_t CodeStatus;
	uint8_t tmp;

	// reset all default state
	txdat = (uint8_t *) TransferCfg->tx_data;
	rxdat = (uint8_t *) TransferCfg->rx_data;
	// Reset I2C setup value to default state
	TransferCfg->tx_count = 0;
	TransferCfg->rx_count = 0;
	TransferCfg->status = 0;

	if (Opt == I2C_TRANSFER_POLLING){

		/* First Start condition -------------------------------------------------------------- */
		TransferCfg->retransmissions_count = 0;
retry:
		// reset all default state
		txdat = (uint8_t *) TransferCfg->tx_data;
		rxdat = (uint8_t *) TransferCfg->rx_data;
		// Reset I2C setup value to default state
		TransferCfg->tx_count = 0;
		TransferCfg->rx_count = 0;
		CodeStatus = 0;

		// Start command
		CodeStatus = I2C_Start(i2c);
		if ((CodeStatus != I2C_I2STAT_M_TX_START) \
				&& (CodeStatus != I2C_I2STAT_M_TX_RESTART)){
			TransferCfg->retransmissions_count++;
			if (TransferCfg->retransmissions_count > TransferCfg->retransmissions_max){
				// save status
				TransferCfg->status = CodeStatus;
				goto error;
			} else {
				goto retry;
			}
		}

		/* In case of sending data first --------------------------------------------------- */
		if ((TransferCfg->tx_length != 0) && (TransferCfg->tx_data != NULL)){

